html/docker/container.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>容器</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="image.html"> UP </a>
 |
 <a accesskey="H" href="docker.html"> HOME </a>
</div><div id="content">
<h1 class="title">容器</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">启动</a>
<ul>
<li><a href="#sec-1-1">运行细节</a></li>
<li><a href="#sec-1-2">启动已终止容器</a></li>
</ul>
</li>
<li><a href="#sec-2">后台运行</a></li>
<li><a href="#sec-3">终止</a></li>
<li><a href="#sec-4">进入</a></li>
<li><a href="#sec-5">导出和导入</a>
<ul>
<li><a href="#sec-5-1">docker import 和docker load的区别</a></li>
</ul>
</li>
<li><a href="#sec-6">删除</a></li>
</ul>
</div>
</div>
<ul class="org-ul">
<li>容器：独立运行的一个或一组应用，以及它们的运行态环境 
</li>
<li>虚拟机：模拟运行的一整套操作系统（提供了运行态环境和其他系统环境）和跑在上面的应用
</li>
</ul>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">启动</h2>
<div class="outline-text-2" id="text-1">
<p>
使用 docker run 命令启动容器
</p>
<div class="org-src-container">

<pre class="src src-bash">$ sudo docker run ubuntu:latest /bin/echo 'Hello world'

Hello World
</pre>
</div>
<p>
这和本地使用/bin/echo 'Hello World'几乎没有任何区别
</p>

<p>
启动容器并开启一个bash进程
</p>
<ul class="org-ul">
<li>-t 选项让Docker分配一个伪终端（pseudo-tty）并绑定到容器的标准输入上
</li>
<li>-i 则让容器的标准输入保持打开
</li>
</ul>
<div class="org-src-container">

<pre class="src src-bash">$ sudo docker run -t -i ubuntu /bin/bash

$root@ca9ae7243716:/# 

$root@ca9ae7243716:/# pwd
 /

$root@ca9ae7243716:/# ls
bin  boot  dev  etc  home  lib  lib64  media  mnt  opt  proc  root  run  sbin  srv  sys  tmp  usr  var
</pre>
</div>
</div>
<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">运行细节</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Docker 在后台运行的标准操作包括：
</p>
<ul class="org-ul">
<li>检查本地是否存在指定的镜像，不存在就从公有仓库下载
</li>
<li>利用镜像创建并启动一个容器
</li>
<li>分配一个文件系统，并在只读的镜像层外面挂载一层可读写层
</li>
<li>从宿主主机配置的网桥接口中桥接一个虚拟接口到容器中去
</li>
<li>从地址池配置一个 ip 地址给容器
</li>
<li>执行用户指定的应用程序
</li>
<li>执行完毕后容器被终止
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">启动已终止容器</h3>
<div class="outline-text-3" id="text-1-2">
<p>
docker start 命令，直接将一个已经终止的容器启动运行。
</p>

<div class="org-src-container">

<pre class="src src-bash">root@ca9ae7243716:/# exit
exit

$ sudo docker start ca9ae7243716
ca9ae7243716

$ sudo docker ps

CONTAINER ID        IMAGE               COMMAND             CREATED             STATUS              PORTS               NAMES
ca9ae7243716        ubuntu:latest       "/bin/bash"         10 minutes ago      Up 7 seconds                            compassionate_rosalind

$ sudo docker attach ca9ae7243716
root@ca9ae7243716:/#
</pre>
</div>

<p>
容器的核心为所执行的应用程序，所需要的资源都是应用程序运行所必需的。除此之外，并没有其它的资源
</p>

<p>
在伪终端中利用 ps 或 top 来查看进程信息
</p>
<div class="org-src-container">

<pre class="src src-bash">root@ca9ae7243716:/# ps

PID TTY          TIME CMD
    1 ?        00:00:00 bash
   13 ?        00:00:00 ps
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">后台运行</h2>
<div class="outline-text-2" id="text-2">
<p>
-d：让 Docker 容器在后台以守护态形式运行
</p>
<div class="org-src-container">

<pre class="src src-bash">$ sudo docker run -d ubuntu /bin/sh -c "while true; do echo hello world; sleep 1; done"

de657bfb4b97f14936769591fd0e9ca62d3ff9b34bb7136dbdfa4fef710b7c13
</pre>
</div>
<p>
容器启动后会返回一个唯一的 id，通过 docker ps 命令来查看容器信息 
</p>
<div class="org-src-container">

<pre class="src src-bash"> $ sudo docker ps

CONTAINER ID        IMAGE               COMMAND                CREATED             STATUS              PORTS               NAMES
de657bfb4b97        ubuntu:latest       "/bin/sh -c 'while t   9 minutes ago       Up 9 minutes                            thirsty_fermat
</pre>
</div>
<p>
通过 docker logs 获取容器输出
</p>
<div class="org-src-container">

<pre class="src src-bash">$ sudo docker logs thirsty_fermat

hello world
hello world
hello world
hello world
hello world
hello world
hello world
...
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">终止</h2>
<div class="outline-text-2" id="text-3">
<p>
使用 docker stop 来终止一个运行中的容器
</p>
<div class="org-src-container">

<pre class="src src-sh">$ sudo docker stop de657bfb4b97
</pre>
</div>
<ol class="org-ol">
<li>当Docker容器中指定的应用终结时，容器也自动终止
</li>
<li>处于终止状态的容器，可以通过 docker start 命令来重新启动
</li>
<li>docker restart 命令会将一个运行态的容器终止，然后再重新启动它
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">进入</h2>
<div class="outline-text-2" id="text-4">
<p>
在使用 -d 参数时，容器启动后会进入后台。
</p>

<p>
使用 docker attach 命令进入容器进行操作
</p>
<div class="org-src-container">

<pre class="src src-bash">$ sudo docker run -idt ubuntu
243c32535da7d142fb0e6df616a3c3ada0b8ab417937c853a9e1c251f499f550

$ sudo docker ps
CONTAINER ID        IMAGE               COMMAND             CREATED             STATUS              PORTS               NAMES
243c32535da7        ubuntu:latest       "/bin/bash"         18 seconds ago      Up 17 seconds                           nostalgic_hypatia

$sudo docker attach nostalgic_hypatia
root@243c32535da7:/#
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">导出和导入</h2>
<div class="outline-text-2" id="text-5">
<p>
使用 docker export 命令导出容器
</p>
<div class="org-src-container">

<pre class="src src-bash">$ sudo docker ps -a
CONTAINER ID        IMAGE               COMMAND             CREATED             STATUS                    PORTS               NAMES
7691a814370e        ubuntu:14.04        "/bin/bash"         36 hours ago        Exited (0) 21 hours ago                       test

$ sudo docker export 7691a814370e &gt; ubuntu.tar
</pre>
</div>

<p>
可以使用 docker import 从容器快照文件中再导入为镜像
</p>
<div class="org-src-container">

<pre class="src src-bash">$ cat ubuntu.tar | sudo docker import - test/ubuntu:v1.0

$ sudo docker images
REPOSITORY          TAG                 IMAGE ID            CREATED              VIRTUAL SIZE
test/ubuntu         v1.0                9d37a6082e97        About a minute ago   171.3 MB
</pre>
</div>

<p>
通过指定 URL 或者某个目录来导入
</p>
<div class="org-src-container">

<pre class="src src-bash">$ sudo docker import http://example.com/exampleimage.tgz example/imagerepo
</pre>
</div>
</div>

<div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1">docker import 和docker load的区别</h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li>import容器快照文件将丢弃所有的历史记录和元数据信息（即仅保存容器当时的快照状态），而load镜像存储文件将保存完整记录，体积也要大
</li>
<li>import容器快照文件导入时可以重新指定标签等元数据信息
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">删除</h2>
<div class="outline-text-2" id="text-6">
<p>
使用 docker rm 来删除一个处于终止状态的容器
</p>
<div class="org-src-container">

<pre class="src src-sh">$ sudo docker rm  trusting_newton

trusting_newton
</pre>
</div>
<p>
-f: 强制删除一个运行的容器，docker会发送SIGKILL信号给容器
</p>

<p>
<a href="repository.html">Next：仓库</a>
</p>

<p>
<a href="image.html">Previous：镜像</a>
</p>

<p>
<a href="docker.html">Home：目录</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">

		  <br/>
		  <div class='ds-thread'></div>
		  <script>
		  var duoshuoQuery = {short_name:'klose911'};
		  (function() {
					  var dsThread = document.getElementsByClassName('ds-thread')[0];
					  dsThread.setAttribute('data-thread-key', document.title);
					  dsThread.setAttribute('data-title', document.title);
					  dsThread.setAttribute('data-url', window.location.href);
					  var ds = document.createElement('script');
					  ds.type = 'text/javascript';ds.async = true;
					  ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
					  ds.charset = 'UTF-8';
					  (document.getElementsByTagName('head')[0] 
						|| document.getElementsByTagName('body')[0]).appendChild(ds);
					  })();
		  </script>
		  <script>
		  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
			(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
			m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
			})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		  ga('create', 'UA-90850421-1', 'auto');
		  ga('send', 'pageview');
		  </script>
</div>
</body>
</html>
